'use strict';

let a = "" + 1 + 0;
alert(`особенность бинарного плюса: ${a} (получилась строка)`);
let b = "" - 1 + 0;
alert(b);
let n = true + false;
alert(`пробразует не числа в числа: ${true + false}`);
let c = 6 / "3";
alert(`пробразует не числа в числа: ${c}`);
let d = "2" * "3";
alert(`пробразует не числа в числа: ${d}`);
let e = 4 + 5 + "px"
alert(`${e}`);
let f = "$" + 4 + 5;
alert(`особенность бинарного плюса: ${f} (получилась строка)`);
let g = "4" - 2;
alert(`пробразует не числа в числа: ${g}`);
let h = "4px" - 2;
alert(`${h}`);
let i = "  -9  " + 5
alert(`особенность бинарного плюса: ${i} (получилась строка)`);
let j = "  -9  " - 5;
alert(`пробразует не числа в числа: ${j}`);
let k = null + 1;
alert(`${k}`);
let l = undefined + 1;
alert(`${l}`);
let m = " \t \n" - 2;
alert(`${m}`);